Documents/Инвентаризация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Document>
		<Properties>
			<Name>Инвентаризация</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ИнгредиентыВНаличии</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Заведение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Заведения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Блюда</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Блюдо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Блюда</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоОстаток</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоФакт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТолькоПросмотр</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Ингредиенты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Продукт</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Продукты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоОстаток</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоФакт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТолькоПросмотр</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ИнгредиентыВНаличии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<AccumulationRegister>
		<Properties>
			<Name>ИнгредиентыВНаличии</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Продукты</v8:Type>
						<v8:Type>cfg:CatalogRef.Блюда</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Заведение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.Продажа</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/Инвентаризация/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не ПроверкаРолиНаСервере.ЕстьРоль("Директор") Тогда
		УстановитьПривилегированныйРежим(Истина);
		Объект.Заведение = ПараметрыСеанса.ТекущийСотрудник.Заведение;
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОстаткамиНаСервере()
	
	Если Не ЗначениеЗаполнено(Объект.Заведение) Тогда
		
		Объект.Блюда.Очистить();
		Объект.Ингредиенты.Очистить();
		Возврат;
		
	КонецЕсли;
	
	
	Склады = Новый СписокЗначений;
	
	Если Не ЗначениеЗаполнено(Объект.Склад) Тогда
		
		Выборка = Справочники.Склады.Выбрать( , Объект.Заведение);
		Пока Выборка.Следующий() Цикл
			Склады.Добавить(Выборка.Ссылка);
		КонецЦикла;
		
	Иначе
		
		Склады.Добавить(Объект.Склад);
		
	КонецЕсли;

	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИнгредиентыВНаличииОстатки.Номенклатура КАК Блюдо,
		|	ИнгредиентыВНаличииОстатки.КоличествоОстаток КАК КоличествоОстаток
		|ИЗ
		|	РегистрНакопления.ИнгредиентыВНаличии.Остатки КАК ИнгредиентыВНаличииОстатки
		|ГДЕ
		|	ИнгредиентыВНаличииОстатки.Заведение В (&Склады)
		|	И ИнгредиентыВНаличииОстатки.Номенклатура ССЫЛКА Справочник.Блюда";
	
	Запрос.УстановитьПараметр("Склады", Склады);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Объект.Блюда.Очистить();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СтрокаТЧ = Объект.Блюда.Добавить();
		СтрокаТЧ.Блюдо = ВыборкаДетальныеЗаписи.Блюдо;
		СтрокаТЧ.КоличествоОстаток = ВыборкаДетальныеЗаписи.КоличествоОстаток;
		СтрокаТЧ.ТолькоПросмотр = Истина;
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИнгредиентыВНаличииОстатки.Номенклатура КАК Продукт,
		|	ИнгредиентыВНаличииОстатки.КоличествоОстаток КАК КоличествоОстаток
		|ИЗ
		|	РегистрНакопления.ИнгредиентыВНаличии.Остатки КАК ИнгредиентыВНаличииОстатки
		|ГДЕ
		|	ИнгредиентыВНаличииОстатки.Заведение В (&Склады)
		|	И ИнгредиентыВНаличииОстатки.Номенклатура ССЫЛКА Справочник.Продукты";
	
	Запрос.УстановитьПараметр("Склады", Склады);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Объект.Ингредиенты.Очистить();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		СтрокаТЧ = Объект.Ингредиенты.Добавить();
		СтрокаТЧ.Продукт = ВыборкаДетальныеЗаписи.Продукт;
		СтрокаТЧ.КоличествоОстаток = ВыборкаДетальныеЗаписи.КоличествоОстаток;
		СтрокаТЧ.ТолькоПросмотр = Истина;
	
	КонецЦикла;
		
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьОстатками(Команда)
	ЗаполнитьОстаткамиНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
		
	//Элементы.Блюда.ИзменятьСоставСтрок = Ложь;
	//Элементы.Ингредиенты.ИзменятьСоставСтрок = Ложь;
		
КонецПроцедуры

&НаКлиенте
Процедура БлюдаПередУдалением(Элемент, Отказ)
	Отказ = Элемент.ТекущиеДанные.ТолькоПросмотр;
КонецПроцедуры

&НаКлиенте
Процедура ИнгредиентыПередУдалением(Элемент, Отказ)
	Отказ = Элемент.ТекущиеДанные.ТолькоПросмотр
КонецПроцедуры
